{"data":{"blogs":{"blogs":[{"status":"PUBLISHED","updatedAt":"2019-08-22T22:15:16.214Z","createdAt":"2019-08-22T08:31:36.934Z","id":"cjzmfg0km50o50963wu1soor1","title":"Why use text to speech over human narration for e-learning?","content":{"html":"<p>Text-to-speech(TTS) technology has advanced a lot in the last decade. The quality of the voices are becoming closer to the human voice thanks to machine learning. This improves the user experience for end-users. The end-user being anyone taking a e-learning course.</p><p></p><p>TTS is also known as speech synthesis, the artificial production of human speech. High quality synthetic voices can be expensive for businesses as commercial licences are expensive. Even monotonous robotic voices are not cheap. Verby provides high quality voices at a competitive price for either personal or commercial use. The webapp uses a Pay As You Go model, meaning businesses are not tied to a monthly or annual subscription. Try the web app for <a style=\"cursor:pointer\" title=\"https://verby.co/join\" href=\"https://verby.co/join\" class=\"css-1krxz7y\">free</a>.</p><p></p><p>These are some viable reasons for using TTS:</p><ul class=\"css-lojjem\"><li><div>The most important reason is providing accessible learning material for everyone. This benefits people who have visual impairment, learning disabilities, or people whose English is their second language. TTS caters for people who are illterate. <a style=\"cursor:pointer\" title=\"https://ourworldindata.org/literacy\" href=\"https://ourworldindata.org/literacy\" class=\"css-1krxz7y\">17% of the world population</a> cannot read or write. Low cost TTS allows learning content to reach to the developing countries, benefiting society.</div></li><li><div>Before sending out script to professional, use TTS for reviewing content. This saves time on do-overs.</div></li><li><div>Course content changes often. It is time-consuming and costly to continually re-record audio with human narration. TTS makes content updates faster, easier and cheaper. Businesses can update content in multiple languages for their global workforce. E-learning professionals can quickly update their learning materials to their customers and reach new audiences.</div></li><li><div>Finding someone with a good voice talent can be difficult or costly. A human native speaker is not always able to consistently produce the correct pronunciation. Verby's voices are low-cost, and provides consistent pronounciation that speaks at a steady pace. This allows people to understand the learning materials better.</div></li></ul><p></p><p>Verby's natural voices can distinguish the phonetics between english words; words that have two possible pronounciations. For example live, rhyming with 'give', means 'to be alive' and another rhyming with 'dive', means 'being alive'. Simply write or paste your text in the text area and not worry about getting the wrong audio output.</p><p></p><p>Verby is available in British English, American English, Australian English, Japanese, French, German, Italian, Dutch, Portuguese, Russian, Korean, Vietnamese and Hindi</p><p></p><p></p>"},"slogan":"Text to Speech offers E-Learning professionals a faster and cheaper alternative in producing e-learning modules compared to human narration.","order":0,"tags":"TEXT_TO_SPEECH","blogimage":{"status":"PUBLISHED","updatedAt":"2019-08-22T20:47:14.921Z","createdAt":"2019-08-22T20:47:14.921Z","id":"cjzn5q1nt8uto0959jhmij8rj","url":"https://media.graphcms.com/EWvqN8jRMK8n8Iy8lNqN","handle":"EWvqN8jRMK8n8Iy8lNqN","fileName":"j-kelly-brito-PeUJyoylfe4-unsplash.jpg","height":667,"width":1000,"size":99950,"mimeType":"image/jpeg"},"slug":"why-use-tts-for-elearning-narration","publisheddate":"6 Aug 2019"},{"status":"PUBLISHED","updatedAt":"2019-08-22T22:15:06.404Z","createdAt":"2019-08-22T08:34:08.373Z","id":"cjzmfj9f96gna0971b6766fzc","title":"The machines are starting to speak like us","content":{"html":"<p>The demand for Text to Speech (TTS) is increasing and the use case is extending beyond screen readers and assisted reading. In the last few years, machine learning has remarkably produce synthetic voice closer to human speech. This improves the experience for listeners, however, it doesn’t entirely hide the uncanny robotic voice, but in the very near future, you will hardly tell the difference between a machine and human.</p><p></p><h3><strong>Natural Voices</strong></h3><h3><strong></strong></h3><h3><strong></strong></h3><p>TTS voices can also produce consistent pronunciations. This can help language learners. TTS with machine learning is expensive in the long run for screen readers. However as the cost of computing power decreases, in the very near future, smartphones and laptops will have more natural screen readers prebuilt in the software. Dedicated machine learning chips will become the norm to generate natural voices. This will allow more people will have access to high-quality natural voices. The current screen readers in Macbook OS and Windows still sound robotic and monotonous. This still many irritate some people and ruin their internet browsing experience. Conversely, natural voices will provide vastly improved user experience.</p><p></p><h3><strong>Custom Voices</strong></h3><h3><strong></strong></h3><p>Smart home devices; they’re talking too. Home appliances can update users of status changes. A robot vacuum cleaner, for example, can tell you when it is time to charge or when it gets stuck somewhere in the room. It could say “I’m stuck, please help me”, instead of beeping noises.</p><p>In Iron Man, Jarvis is Tony Stark’s artificial intelligence assistance. Could one day we have our own JARVIS? Of course. The voices could also be personalised; a bespoke voice to assist your daily needs or even have conversations with you. This is uniquely beneficial for people who have their voice because of diseases such as <strong>Amyotrophic lateral sclerosis (ALS)</strong>. It’s a motor neurone disease that causes the death of neurons controlling voluntary muscle such as the tongue, arms and legs. It’s the same disease that struck Dr Stephen Hawkings. He relied on a speech-generating device, built by Intel. Read more about it <a style=\"cursor:pointer\" title=\"https://inews.co.uk/news/technology/how-technology-gave-stephen-hawking-a-voice-intel-synthesiser/\" href=\"https://inews.co.uk/news/technology/how-technology-gave-stephen-hawking-a-voice-intel-synthesiser/\" class=\"css-1krxz7y\">here</a>.</p><p></p><h3><strong>Improving lives</strong></h3><h3><strong></strong></h3><h3><strong></strong></h3><p>ALS has taken many people’s ability to speak. ALS Association has partnered with a startup, <a style=\"cursor:pointer\" title=\"https://lyrebird.ai/\" href=\"https://lyrebird.ai/\" class=\"css-1krxz7y\"><strong>Lyrebird</strong></a>, to work on a non-profit initiative called Project Revoice. Their mission is to ensure people with ALS don’t have to suffer after their voices are robbed. They will work with ALS patients to create a digital clone of their voices that aims to fully recreates the unique essence, nuance and accent of any individual.</p><p></p><p>Text to speech can aid speakers and voice actors to prepare their speeches. But it will not fully replace their art, like seminars, sermons, spoken word performances. At the moment, the quality of AI voices cannot mimic the soul of a person as they lack an identity.</p><p>Motivational speeches is an art form. The current challenge is for machines to become creative and create their own style. There is a standardised editor that lets you add emphasis to certain words and change pitch and speed of sentences. This still doesn’t add character to a machine’s voice, but it’s exciting to know that there is potential for this technology. The technology will need to be regulated as it gets perfected. Voice cloning does cause for concern on ethics. Bad apples will abuse this technology for voice phishing for example, but the benefits outweigh the cons.</p><p></p><p>Text to Speech should be accessible for all. Other tts solutions are expensive for commercial use. That is why Verby was created; to help students and professionals alike. Its simple user interface allows visitors to easily convert text to speech. The basic voices are free to use and download to mp3. You can also create an account and get 1000 characters to try premium voices.</p><p></p><h4><strong></strong><a style=\"cursor:pointer\" title=\"https://verby.co\" href=\"https://verby.co\" class=\"css-1krxz7y\"><strong>Verby.co</strong></a><strong></strong></h4><p></p>"},"slogan":"What you need to know about the future of Text to Speech.","order":1,"tags":"MACHINE_LEARNING","blogimage":{"status":"PUBLISHED","updatedAt":"2019-08-22T20:47:14.921Z","createdAt":"2019-08-22T20:47:14.921Z","id":"cjzn5q1nt8utn0959cnw85sxc","url":"https://media.graphcms.com/6dTW1DrORmiTmURrZJpM","handle":"6dTW1DrORmiTmURrZJpM","fileName":"robot.jpeg","height":667,"width":1000,"size":85335,"mimeType":"image/jpeg"},"slug":"future-of-text-to-speech","publisheddate":"14 Aug 2019"},{"status":"PUBLISHED","updatedAt":"2019-08-22T22:09:37.921Z","createdAt":"2019-08-22T21:44:38.042Z","id":"cjzn7rue2937d0963xzfmi6t4","title":"Transform customer self-service with text to speech","content":{"html":"<p>Interactive Voice Response (IVR) gives callers an engaging way to resolve their issues.  Each caller can choose an option by pressing-1, 2, and 3. </p><p></p><p>In the past, text to speech software sounded too robotic and pronunciation was inaccurate.</p><p>Now, text to speech is a viable way to automate customer service as the voices sound more clear and more similar to the human voice. Customers can now hear the vital information they need.</p><p></p><p>Combining IVR and text to speech (TTS) lets businesses provide customers  with around the clock support. It gives callers access to information anytime, anywhere and in multiple languages. This lowers operation costs for businesses by reducing agent calls, improve call routing and customer satisfaction.</p><p></p><p>IVR is not just used for calling. It can be useful to visually impaired users when accessing web apps. Companies can provide text to speech in their chat bots in multiple languages. Most chatbots give text as prompts, but with TTS, a business can improve customer engagement and reach a new audience.</p><p></p><p><a style=\"cursor:pointer\" title=\"https://verby.co\" href=\"https://verby.co\" class=\"css-1krxz7y\">Verby's text to speech</a> web app is free for commercial use starting on our basic voices.  Simply type and paste your text in the text area. Save as your preferred file name and click Download. Then you can use the generated mp3 file and upload them to your IVR system. Although Verby does not provide a turn-key IVR system, its text to speech conversion could be used with your existing legacy IVR systems by replacing your old recordings with the generated mp3 voices. A new generation <a style=\"cursor:pointer\" title=\"https://www.nuance.com/omni-channel-customer-engagement/voice-and-ivr/text-to-speech.html\" href=\"https://www.nuance.com/omni-channel-customer-engagement/voice-and-ivr/text-to-speech.html\" class=\"css-1krxz7y\">turn-key IVR system</a> is already in the market.</p>"},"slogan":"Your current IVR system is outdated. Text to speech can breath it new life and customers will love it.","order":null,"tags":"TEXT_TO_SPEECH","blogimage":{"status":"PUBLISHED","updatedAt":"2019-08-22T21:56:20.832Z","createdAt":"2019-08-22T21:56:20.832Z","id":"cjzn86wo093z80959p6d50oeq","url":"https://media.graphcms.com/VOhH3Gp2QG2YQx4RIZRA","handle":"VOhH3Gp2QG2YQx4RIZRA","fileName":"customerservice.jpg","height":819,"width":1000,"size":151662,"mimeType":"image/jpeg"},"slug":"tts-for-ivr-customer-service","publisheddate":"22 Aug 2019"},{"status":"PUBLISHED","updatedAt":"2019-09-02T09:30:40.978Z","createdAt":"2019-09-02T09:22:22.142Z","id":"ck0273nlqf9l70906nsz45thx","title":"Study tips for Auditory Learners","content":{"html":"<p>Auditory learners learn best when actively listening to instruction or information. Other than listening, learners prefer to engage in discussions and watch video clips.  </p><p></p><p>Some learners adopt a combination of learning styles or may want to experiment with another.</p><p></p><p>How do you identify yourself as auditory learner?  These are few of the characteristics:</p><ul class=\"css-lojjem\"><li><div>Good at memorising lyrics\n.</div></li><li><div>Good at explaining this out loud\nEnjoy discussions, debates and interacting with others. </div></li><li><div>\nSocially active and a great listener\n. </div></li><li><div>\nFollows verbal directions well\n</div></li></ul><p></p><p>If you are an auditory learner, try these strategies to improve your learning experience.</p><p></p><h3>Listen to classical music</h3><p></p><p>Listen to lyric-free music while studying. Music will reduce stress and anxiety making studying more pleasant. Pick any genre you want, as long it helps you study.  </p><p></p><h3>Buddy up</h3><p></p><p>\n\nFind a reliable study partner to discuss ideas and quiz each other on the class content. Also teaching each other will help increase your understanding and retain information better. </p><p></p><h3>\n\nRecord class lectures</h3><p></p><p>\n\nFind a spot in the front row so that you can hear every word of the lecture. Ask your lecturer's permission to create audio recordings of class lectures. This is not an excuse to be distracted in class. Actively listen to the lecturer and jot down everything down. Later, you can listen back to the recording and highlight the most important parts.\n\nIf a lecturer would not give permission, just record it anyway and keep it for yourself and don’t share it others.</p><p></p><p>\n\nOr you can use a text to speech app to <a style=\"cursor:pointer\" title=\"https://verby.co\" href=\"https://verby.co\" class=\"css-1krxz7y\">convert your notes to mp3</a>.\n\n</p><p></p><h3>Read out loud\n\n</h3><p></p><p>Read out loud to yourself (if you are alone in your room). Pick out the main points from your notes and try paraphrasing it.\n\n</p><p></p><h3>Ask questions</h3><p></p><p>\n\nYou should aim to raise your hand to ask questions in class. Don’t be embarrassed in asking stupid questions, it will increase information retention. It will show you are pay attention as well.\n</p><p></p><p></p>"},"slogan":"Back to School: Learn by hearing","order":null,"tags":"PRODUCTIVTY","blogimage":{"status":"PUBLISHED","updatedAt":"2019-09-02T07:52:52.419Z","createdAt":"2019-09-02T07:52:52.419Z","id":"ck023wkarj6zz0936rim91vk9","url":"https://media.graphcms.com/nd3MKnnwRTt7dPgVp6Z0","handle":"nd3MKnnwRTt7dPgVp6Z0","fileName":"aiony-haust-ZXKL4mwbSRA-unsplash.jpg","height":1150,"width":1000,"size":141365,"mimeType":"image/jpeg"},"slug":"study-tips-for-auditory-learners","publisheddate":"2 Sept 2019"}]}}}